const nameMap = {
  'prelims': '预选',
  'honors': '贡献度',
  'crewHoners': '骑空团贡献度',
  'individualHoners': '个人贡献度',
  'rankings': '排位',
  'crewRankings': '骑空团排位',
  'individualRankings': '个人排位',

  'finals': '本战',
  'tierA': 'A排',
  'tierB': 'B排',
  'tierC': 'C排',
  'notRank': '圈外',

  'win': '胜场',
  'lose': '败场'
}

const valueMap = {
  // 十万
  '10万': 100000,
  '15万': 150000,
  '16万': 160000,
  '20万': 200000,
  '30万': 300000,
  '36万': 360000,
  '40万': 400000,
  '48万': 480000,
  '50万': 500000,
  '90万': 900000,

  // 百万
  '100万': 1000000,
  '120万': 1200000,
  '180万': 1800000,
  '250万': 2500000,
  '350万': 3500000,
  '500万': 5000000,
  '600万': 6000000,

  // 千万
  '1000万': 10000000,
  '3000万': 30000000,
  '3500万': 35000000,
  '5000万': 50000000,
  '9000万': 90000000,

  // 亿
  '1亿': 100000000,
  '1.5亿': 150000000,
  '1.5亿': 250000000,

  // 十亿
  '10亿': 1000000000,
  '30亿': 3000000000
}

export { nameMap, valueMap }
